IDEA StatiCa Open Model
NadSetupValue Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Setup value base
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.NadSetupValue
 More...
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class NadSetupValue
Public MustInherit Class NadSetupValue
public ref class NadSetupValue abstract
The NadSetupValue type exposes the following members.
Constructors
Name | Description
NadSetupValue
Initializes a new instance of the NadSetupValue class
Top
Properties
Name | Description
Id
 Gets or sets the value id.
IsActive
 Is active
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.NadSetupValue
 IdeaRS.OpenModel.Concrete.NadSetupValueBool
 IdeaRS.OpenModel.Concrete.NadSetupValueDouble
 IdeaRS.OpenModel.Concrete.NadSetupValueFloat
 IdeaRS.OpenModel.Concrete.NadSetupValueInt
 IdeaRS.OpenModel.Concrete.NadSetupValueLong
 IdeaRS.OpenModel.Concrete.NadSetupValueShort